_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 2, 33, 24)         120024    
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 1, 17, 36)         21636     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 1, 9, 48)          43248     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 1, 9, 64)          27712     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 1, 9, 64)          36928     
_________________________________________________________________
flatten_1 (Flatten)          (None, 576)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 100)               57700     
_________________________________________________________________
dense_2 (Dense)              (None, 50)                5050      
_________________________________________________________________
dense_3 (Dense)              (None, 10)                510       
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 11        
=================================================================
Total params: 312,819
Trainable params: 312,819
Non-trainable params: 0
_________________________________________________________________
